Revit 2024 API
SolidUtils.IsValidForTessellation Method
 Tests if the input solid or shell is valid for tessellation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidForTessellation(
	Solid solidOrShell
)
Visual Basic
Public Shared Function IsValidForTessellation ( _
	solidOrShell As Solid _
) As Boolean
Visual C++
public:
static bool IsValidForTessellation(
	Solid^ solidOrShell
)
Parameters
solidOrShell
Type: Autodesk.Revit.DB.Solid
 The solid or shell.
Return Value
 True if the solid or shell is valid for tessellation, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SolidUtils Class
Autodesk.Revit.DB Namespace